In [114]:
import pandas as pd

In [115]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 


df = pd.DataFrame(data)
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

- **Uppercase Lowercase shift in df**

In [116]:
df["Address"] = df["Address"].str.lower()
df

     Name  Age    Address Qualification
0     Jai   27      delhi           Msc
1  Princi   24     kanpur            MA
2  Gaurav   22  allahabad           MCA
3    Anuj   32    kannauj           Phd

In [117]:
df["Address"] = df["Address"].str.upper()
df

     Name  Age    Address Qualification
0     Jai   27      DELHI           Msc
1  Princi   24     KANPUR            MA
2  Gaurav   22  ALLAHABAD           MCA
3    Anuj   32    KANNAUJ           Phd

- **Split and replace**

In [118]:
df["Address"] = df["Address"].str.split("A", n=1).str[1]
df.dropna(inplace=True)
df

     Name  Age   Address Qualification
1  Princi   24      NPUR            MA
2  Gaurav   22  LLAHABAD           MCA
3    Anuj   32     NNAUJ           Phd

In [119]:
df["Age"] = df["Age"].replace(24, "Twenty Four")
df

     Name          Age   Address Qualification
1  Princi  Twenty Four      NPUR            MA
2  Gaurav           22  LLAHABAD           MCA
3    Anuj           32     NNAUJ           Phd

- **Concatenation**

In [ ]:
df["Name"] = df["Name"].str.cat(df["Address"], sep='-')
df.drop()

              Name          Age   Address Qualification
1      Princi-NPUR  Twenty Four      NPUR            MA
2  Gaurav-LLAHABAD           22  LLAHABAD           MCA
3       Anuj-NNAUJ           32     NNAUJ           Phd